{
  "url": "https://www.positivediscipline.com/articles/temper-tantrums",
  "topic_id": "tantrums",
  "topic_title": "Taming Tantrums",
  "scraped_at": "2026-01-26T15:37:25.270235",
  "source_type": "web",
  "title": "Temper Tantrums Have Returned in My 4-year-old",
  "text": "Question:\n\nMy daughter is 4 1/2. This past week or two her behavior has not been very good. She has starting having MAJOR temper tantrums. For example, we will go to get dressed and I will say it is cold today, pick out what pants you want to wear, and she will say NO I want a dress and it will go downhill from there. Also, she has trouble staying dry all night. I do not make an issue of this at all. But she had been coming in our bed after she wet hers and would also wet our bed, so I told her if she wanted to get in our bed she could, but she would have to put on her pull ups which she refuses to do, and will have a MAJOR tantrum in the middle of the night. Nothing I have tried seems to work. I have tried sending her to her room, she just walks out and continues to scream, I have tried spanking with a newspaper (I had heard from that if you choose to spank never use your hand). Help!\n\nAnswer:\n\nHave you read the “I Need a Hug” article? That is a good place to start. Next, start having family meetings. Your child is old enough to learn problem-solving skills.\n\nIt is difficult for most people (children and adults) to verbalize feelings when they are upset. Many can’t verbalize their feelings at any time. Family meetings should be held at regularly scheduled times. Put problems on the agenda and then discuss them when people are not upset. Teach your daughter how to brainstorm for solutions. Temper tantrums often occur when children feel controlled. When they are involved in solutions, they learn to use their power in constructive ways.\n\nAnother reason children often have temper tantrums is because they have not learned more appropriate ways to express their needs and wants, and because developmentally they have not learned delayed gratification. This does not mean we should be permissive until they learn these skills, but it does explain why we should be both kind and firm in our actions. Kindness shows respect for the child. Firmness shows respect for the needs of the situation and for parents. Spanking and punitive time out are not kind.\n\nWe have many more suggestions for what to do about tantrums in our book Positive Discipline A-Z, but I would try this one first.",
  "summary": "Question:\n\nMy daughter is 4 1/2. This past week or two her behavior has not been very good. She has starting having MAJOR temper tantrums. For example, we will go to get dressed and I will say it is cold today, pick out what pants you want to wear, and she will say NO I want a dress and it will go downhill from there. Also, she has trouble staying dry all night. I do not make an issue of this at all. But she had been coming in our bed after she wet hers and would also wet our bed, so I told her ",
  "authors": [
    "Neena Spina",
    "Mark Powell"
  ],
  "publish_date": "2016-01-06T18:08:48+00:00",
  "top_image": "https://www.positivediscipline.com/sites/default/files/janesig.gif",
  "method": "newspaper3k",
  "fingerprint": "66f0d847a01a109e",
  "age_groups": [
    "2-4"
  ]
}