{
  "url": "https://www.parents.com/toddlers-preschoolers/development/behavioral/expert-tips-to-help-your-sensitive-child-navigate-an-overwhelming-world/",
  "topic_id": "tantrums",
  "topic_title": "Taming Tantrums",
  "scraped_at": "2026-01-26T15:36:01.505947",
  "source_type": "web",
  "title": "How to Help Your Deeply Feeling Kid Handle Big Emotions",
  "text": "Those of us with deeply feeling kids know that navigating big emotions can be challenging. For instance, one afternoon, my three children were happily FaceTiming their Uncle Ivan when my then 4-year-old suddenly started wailing. \"He called me poopy-face,\" he hiccupped between sobs. What their uncle had meant as an affectionate joke, my son had taken as mean-spirited teasing.\n\nStrong feelings have always been tough for my son to process. A skipped snack and he's rolling on the floor, insisting he's about to starve. A fight with his brother over a toy can provoke a minutes-long screaming jag.\n\nAccording to Jadzia Jagiellowicz, PhD, founder of the Highly Sensitive Society, highly sensitive and deeply feeling kids feel things intensely and can become overwhelmed by emotional and physical stimuli. About 20% of the human population is considered highly sensitive. It can be a challenge to parent deeply feeling kids, but it can help to first understand how they're wired.\n\nWhat Being a Deeply Feeling Child Means\n\nDr. Jagiellowicz, who provides mental health services to clients all over the world and conducts research on the neuroscience of sensitive individuals, says that highly sensitive brains are both more receptive to incoming stimuli and more reactive to physiological cues—like an upset stomach or rapid breathing—than their less-sensitive peers.\n\nThat means that not only are highly sensitive kids literally experiencing the world more intensely, but they're also more likely to react to those sensations and feelings more intensely too.\n\nOn the flip side, \"there are a lot of benefits to being a sensitive person,\" says Laura Greenberg, a psychotherapist based in Canada. \"Sensitivity leads to empathy, self-awareness, and creativity.\"\n\nThere are many ways for extra-sensitive kids to harness the positives of this trait while overcoming its challenges. With practice and support, they can learn to manage their emotions to avoid becoming overwhelmed or overly reactive.\n\nHere are a few simple tips parents can employ to help sensitive kids navigate a noisy and sometimes intimidating world.\n\nPhoto: Getty Images.\n\nValidate and Connect\n\nSensitive children frequently feel that their emotional reactions are misunderstood or dismissed by their parents and peers. \"The most valuable, influential thing that you can do for kids with big feelings is to just validate them,\" says Greenberg.\n\nPut yourself in their shoes and let them know that you want to connect with them. Rather than attempting to solve their problem (\"What makes you think that nobody likes you?\"), sit with them in their uncomfortable feelings (\"It must have been so difficult today when Bobby didn't want to play with you.\")\n\nBy validating these feelings, you're helping kids \"jumpstart the regulation process of coping, calming, and tolerating them,\" says Greenberg.\n\nAs your children get older, connecting with them emotionally continues to be crucial. If they don't develop the tools to manage \"those big feelings, there's the risk that they could turn to other behaviors and less healthy coping strategies,\" notes Greenberg.\n\nStaying tuned into your children's feelings means that you'll know if they need additional support as their world gets bigger and more complicated. And they'll know they can turn to you if they need extra support.\n\nIdentify and Name Feelings\n\nIdentifying and naming feelings can go a long way toward helping kids regulate their emotional ups and downs. \"Teach kids feeling words and then model how to express those feelings appropriately,\" says Michelle Felder, LCSW, a licensed clinical social worker and psychotherapist based in New York.\n\n\"If they're shutting down and having a hard time speaking, make that explicit connection for them about what happened and the feeling that they're experiencing.\" When your child refuses to eat their sandwich, for example, because you sliced it into triangles when they wanted rectangles, you could say: \"I noticed that after I cut your sandwich, you got really upset and stopped talking. I wonder if you're feeling frustrated about how it was cut?\"\n\nFor younger kids, or kids who need a bigger nudge to express themselves, provide non-verbal ways to communicate, suggests Harris. Draw faces representing different emotions (such as happy, sad, mad) on index cards, and let your children point to the card that best matches how they're feeling.\n\nOr create a stack of sticky notes with checkboxes for simple responses like \"yes,\" \"no,\" and \"maybe\" when they're too overwhelmed to speak, but can write answers to direct questions. These small communication tweaks can help bridge the gap between frustration and communication.\n\nPrepare for Everything\n\nSensitive and deeply feeling kids thrive on routine and prefer to know exactly what to expect. Before the first day of school, for example, try to bring your child to meet the teacher and see the classroom, so the environment feels more familiar right away. Or walk to school that first morning with a playmate your child already knows. \"Try to keep as much as you can familiar and introduce changes gradually,\" says Dr. Jagiellowicz.\n\nKids who are sensitive often worry about what other people think of them, causing them to freeze in the moment. To combat this, Harris suggests that parents \"prepare language that kids can use to respond in different situations\" and role-play these scenarios. Collaborate with your child on ways to relieve stress appropriately.\n\n\"Come up with a little toolkit of ideas that work for them—whether it's breathing exercises, ripping up some paper, squeezing play dough, stomping, or making animal movements,\" suggests Harris.\n\nCreate Boundaries and Safe Spaces\n\nBecause sensitive children take in more information from their environment and are more reactive to it, a little prevention is worth a pound of cure. For infants, that might mean keeping their sleeping area very quiet. Dr. Jagiellowicz cites the example of coffee aficionados who \"go into the farthest room in the house and close the door whenever they grind coffee because [the noise] upsets their child.\"\n\nFor older kids, create opportunities for downtime after busy and stimulating activities. Help them set boundaries that enable them to safely process tough emotions. \"You might not want to send them to hockey practice and then to a birthday party,\" says Greenberg, since both involve heavy investments of emotional energy. And create a quiet place where they can retreat when they return home.\n\nPractice Gentle Discipline\n\nAmong the characteristics of highly sensitive children is a strong awareness of hypocrisy and morality. For instance, your child may wonder: \"Is this situation fair?\" or \"Why isn't Sally keeping her promises?\" Approach discipline carefully \"because they're already going to criticize themselves if they've done something wrong,\" says Dr. Jagiellowicz.\n\nGentle discipline communicates limits clearly and without judgment; and makes sure consequences are fair and connected to family rules and norms. Above all, don't make it personal: \"You can't have iPad time because you haven't finished your homework yet\" is preferable to \"The iPad is off-limits because you've been bad.\"\n\n\"Emotional memories are stored more deeply [in sensitive children],\" Dr. Jagiellowicz notes. Shame can be particularly toxic. Dr. Jagiellowicz says that it's common for her adult clients to \"remember things from their childhood\" and that negative memories affect them deeply. Greenberg agrees: Sensitive and deeply feeling kids \"feel all their feelings bigger, so they're likely feeling shame bigger\" as well.\n\nUltimately, the goal when parenting a deeply feeling child is to help them understand their emotions and cope with them in healthy, sustainable ways. As parents, our first instinct when our deeply feeling children are struggling is often to \"rescue them from those yucky feelings,\" says Greenberg. Unfortunately, while it comes from a place of love, that approach may not be the most effective for a highly sensitive child.",
  "summary": "Those of us with deeply feeling kids know that navigating big emotions can be challenging. For instance, one afternoon, my three children were happily FaceTiming their Uncle Ivan when my then 4-year-old suddenly started wailing. \"He called me poopy-face,\" he hiccupped between sobs. What their uncle had meant as an affectionate joke, my son had taken as mean-spirited teasing.\n\nStrong feelings have always been tough for my son to process. A skipped snack and he's rolling on the floor, insisting he",
  "authors": [
    "Connie Chang"
  ],
  "publish_date": null,
  "top_image": "https://www.parents.com/thmb/hwjp5lN-lI9HDNqnObmcnaFTLH8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/cGettyImages-616129575-c10f9bd431da4fe6a4b5732773682485.jpg",
  "method": "newspaper3k",
  "fingerprint": "08dd963885c0c0bd",
  "age_groups": [
    "6-8"
  ]
}