{
  "url": "https://www.parents.com/kids/development/behavioral/emotionally-sensitive-children/",
  "topic_id": "tantrums",
  "topic_title": "Taming Tantrums",
  "scraped_at": "2026-01-26T15:36:03.051005",
  "source_type": "web",
  "title": "Supporting Your Emotionally Sensitive Child",
  "text": "Validate your child's feelings to help them feel understood and supported.\n\nTeaching kids to name their emotions improves their emotional awareness and coping skills.\n\nSet realistic expectations to empower children and help them feel in control.\n\nWhen my 6-year-old daughter started acting out in intense ways—like shrieking when I combed her hair, having a meltdown whenever I told her no, and bursting into tears when her little sister teased her—I wondered what was going on. After talking to experts and doing research, I learned that my daughter may just have a high level of emotional sensitivity.\n\nSome children experience emotions more deeply than others. They may get angry more often, feel frustrated faster, and get overly excited compared to their peers.\n\nThe ability to regulate big emotions is largely dependent on age and development. Experiencing things more intensely is also sometimes just part of who someone is.\n\nHere's what I learned about managing my daughter's emotional sensitivity, plus ways parents can help highly sensitive children deal with their own big emotions.\n\nPhoto: Madelyn Goodnight\n\nWhat Is Emotional Sensitivity?\n\nEmotional sensitivity is a phrase that describes how a person responds to their environment. While the concept isn't clearly defined, nor is it something a person will be diagnosed with, some researchers have described it as \"heightened emotional reactivity\" or a \"tendency to have emotional reactions.\"\n\nAnother common term used for emotional sensitivity is \"highly sensitive.\" It generally applies to people who feel emotions more intensely or who have bigger emotional reactions to things.\n\nMost children are born emotionally sensitive by nature, but as they get older, they learn different strategies for managing their emotions. That said, some kids may continue having higher sensitivity, and as a parent or caregiver, you may notice it around the time they're 5 or 6 years old.\n\nAs your child's peers cut back on tantrums and meltdowns and your child does not, it may be a sign that your child is highly sensitive or has a high level of emotional sensitivity.\n\nBefore a child reaches 24 months and sometimes even as old as 36 months, their ability to inhibit behavior is typically low. This doesn't mean you can't start teaching them how to manage their emotions, though. By the time they start preschool, many kids have the skills needed to begin learning how to regulate their emotions.\n\nHelping a Highly Sensitive Child\n\nBig emotions can make life more difficult for kids unless they learn to engage in emotional regulation. While this is naturally learned over time, there are ways you can help your child cultivate emotional awareness and adopt healthy coping skills now.\n\nValidate their feelings\n\nWhen your child cries after an elbow scrape that didn't even break the skin, your first instinct may be telling them to calm down or reassuring them that their injury wasn't bad. But experts say that negating their feelings could just make matters worse, especially if your child hears anger or frustration in your voice.\n\n\"When you try to talk your kid out of what they're feeling, it causes them to hold on to that feeling more tightly and get even more upset,\" says Elinor Bashe, PsyD, a child psychologist in Highland Park, New Jersey. \"It's important to listen to and accept your child's emotions even if they don't seem logical.\" For instance, you could say something like, \"I know it hurts,\" or, \"You must have been surprised when you fell down.\"\n\nHelp children name their emotions\n\nChildren should recognize and define how they're feeling—and you can help by teaching them about emotions. Say, “You look sad right now,” or “I can tell you're mad.” Name your emotions, too, by stating, “I'm sad that we can’t go visit Grandma today,” or “I’m surprised that those boys were being so mean.”\n\nYou can also strike up conversations by talking about characters in books or on TV shows. Every once in a while, ask questions such as, “How do you think this character feels?” With practice, your child’s ability to label their emotions will improve.\n\nEmpower them with information\n\nYoung kids love to be in the know, so use that to your advantage. If your child is scared about getting shots, for example, talk with them before their annual checkup. Explain how the shot prevents a specific disease.\n\nAlso, let your child have some control over the situation For example, once you're in the doctor's office, ask if they want the vaccine in their left arm or right, then let them choose the type of treat (a sticker or a new pencil, for instance) afterward.\n\nSet realistic expectations\n\nAnother way to help your child feel in control: Set realistic expectations before trying something new. For instance, if your highly sensitive child is attempting a 300-piece puzzle and you expect it to end in a meltdown, prep them ahead of time. You could say something like: \"This is harder than your other puzzles, so it's probably going to take a couple of days. Maybe we should work on it together?\"\n\nTeach them coping skills\n\nCoping skills can help your child manage emotions. Read our ideas below, and then, before they're heading into a situation that may lead to big feelings, give reminders about using them. Model them yourself as well, because kids learn a lot from watching their caregivers.\n\nPractice deep breathing . Teach your child how to breathe in slowly and quietly through their nose and then out through their mouth. (Try telling them to \"smell a flower, then blow up a balloon\" to master this.) You may do this together during upsetting moments, but encourage them to employ deep breathing on their own when needed.\n\n. Teach your child how to breathe in slowly and quietly through their nose and then out through their mouth. (Try telling them to \"smell a flower, then blow up a balloon\" to master this.) You may do this together during upsetting moments, but encourage them to employ deep breathing on their own when needed. Brainstorm encouraging mantras. Help your child brainstorm a few positive affirmations to calm themselves down, such as \"Everybody makes mistakes. I will just practice and get better\", \"I can't always get my way\" and so on.\n\nHelp your child brainstorm a few positive affirmations to calm themselves down, such as \"Everybody makes mistakes. I will just practice and get better\", \"I can't always get my way\" and so on. Count to calm down . Your child can distract themselves from big emotions by counting. Numbering the ceiling tiles, counting to 10, or counting down from 100 are just a few mental tasks that might reduce their distress.\n\n. Your child can distract themselves from big emotions by counting. Numbering the ceiling tiles, counting to 10, or counting down from 100 are just a few mental tasks that might reduce their distress. Take a break . Allow your highly sensitive child to give themselves a brief time-out, or ask a teacher if they can step out of the classroom for a minute when they need to calm down.\n\n. Allow your highly sensitive child to give themselves a brief time-out, or ask a teacher if they can step out of the classroom for a minute when they need to calm down. Create a calm-down kit . Fill a box with items that help your child calm down (or cheer up). Coloring books and crayons, scratch-and-sniff stickers, pictures that your child enjoys, and soothing music are just a few items that can engage their senses and help them manage their emotions.\n\n. Fill a box with items that help your child calm down (or cheer up). Coloring books and crayons, scratch-and-sniff stickers, pictures that your child enjoys, and soothing music are just a few items that can engage their senses and help them manage their emotions. Identify mood boosters. Talk to your child about the things they like to do when they're happy, like playing outside, reading a joke book, or singing their favorite songs. Write those things down as \"mood boosters.\" When they're feeling bad, encourage them to engage in a mood booster to help them cope with their feelings.\n\nSeparate feelings and behaviors\n\nChildren should also learn how to express their emotions in a socially appropriate manner. Screaming in the middle of the grocery store, whining, or throwing a temper tantrum at school, for example, aren't acceptable behaviors.\n\nTell children they're allowed to feel any emotion they want, but they can choose how they respond to those uncomfortable feelings. While they have every right to be mad at someone, for example, that does not permit hitting or punching.\n\nAlso, discipline behavior instead of emotions. Say, “You are going to time-out because you hit your brother,” or “You are losing this toy for the rest of the day because you're screaming and it hurts my ears.”\n\nFind a solution together\n\nSometimes, there's no solution to a big feeling. But when appropriate, after validating your child's emotions and letting them settle down, you could empower them to brainstorm ways to feel better. For instance, if they have an injury, you might ask: \"Do you think we should wash it off or put some ice on it? Get a bandage or just rest it?\"\n\nAvoid reinforcing outbursts\n\nThe way you respond to your child’s emotions makes a big difference. Sometimes parents inadvertently encourage kids to have emotional outbursts. If you’re working on helping your child regulate their emotions, it’s best to avoid the following.\n\nRewarding your child for calming down: If you offer your child a special treat whenever they pull themselves together, they may learn that bursting into tears or yelling at their sibling are good ways to get something they want.\n\nIf you offer your child a special treat whenever they pull themselves together, they may learn that bursting into tears or yelling at their sibling are good ways to get something they want. Showering your child with attention: While it’s important to offer comfort, make sure you don’t overdo it. You don’t want your child to learn that getting upset is the best strategy for attracting your attention.\n\nWhile it’s important to offer comfort, make sure you don’t overdo it. You don’t want your child to learn that getting upset is the best strategy for attracting your attention. Calming your child down constantly: It’s helpful to offer reassurance, but it’s also important to teach your child the skills they need to calm themselves down.\n\nIt’s helpful to offer reassurance, but it’s also important to teach your child the skills they need to calm themselves down. Telling your child to stop crying: This might make them more upset. And if they see you getting worked up over their tears, they may think they're doing something wrong—and that won’t make it any easier to stop crying.\n\nThis might make them more upset. And if they see you getting worked up over their tears, they may think they're doing something wrong—and that won’t make it any easier to stop crying. Announcing that your child is sensitive: If you warn every teacher, coach, or friend’s parent that your child is highly sensitive, you may be sending a message that they can’t handle themselves. While it's useful to offer some insight into your child's temperament, it's not a requirement. Only offer this information if you think it will benefit them.\n\nWhen to Seek Professional Help\n\nEmotional learning begins in the toddler years, but research shows that it generally takes kids until they're 8 or 9 to have significant control of it. So, even children who aren't normally overly emotional by nature may go through a period where it seems like the tears keep coming or they're experiencing angry outbursts.\n\nWhile this is usually normal, it’s still worth checking in with your pediatrician to make sure there's not something fueling your observations (for example, an undiagnosed ear infection, another medical condition, or a psychological issue). This is especially important if your child is young and has a hard time communicating.\n\nStudies have demonstrated a connection between emotional dysregulation and a variety of mental health issues as kids get older, including anxiety, depression, substance abuse, suicide ideation, attention deficit hyperactivity disorder (ADHD), and aggression. Thankfully, researchers believe that interventions addressing self-regulatory behaviors may help kids make better progress.\n\nYou should also seek professional help if your child's emotions are causing problems in their everyday life. If they're crying so much during the school day that they can’t concentrate in class, or if they're struggling to maintain friendships because they can’t control their anger, they may need some extra support.\n\nOnce a medical or psychological problem has been ruled out, you can teach your highly sensitive child ways to regulate their emotions. If you need help learning best practices, speak with your care team.\n\nAdditional reporting by Amy Morin, LCSW.",
  "summary": "Validate your child's feelings to help them feel understood and supported.\n\nTeaching kids to name their emotions improves their emotional awareness and coping skills.\n\nSet realistic expectations to empower children and help them feel in control.\n\nWhen my 6-year-old daughter started acting out in intense ways—like shrieking when I combed her hair, having a meltdown whenever I told her no, and bursting into tears when her little sister teased her—I wondered what was going on. After talking to expe",
  "authors": [
    "Michelle Crouch"
  ],
  "publish_date": null,
  "top_image": "https://www.parents.com/thmb/Q5khm21Tj05SSIK6-Ua9XoUEU38=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/How-to-help-an-overly-emotional-child-4157594-Parents-Edit-e65e8073e8c7403891abaed805bb6364.gif",
  "method": "newspaper3k",
  "fingerprint": "629da67e450f7b32",
  "age_groups": [
    "2-4",
    "4-6",
    "6-8"
  ]
}