{"url": "https://www.parents.com/emotional-regulation-skills-8692759", "title": "Emotional Regulation Skills: What Parents Need to Teach Their Kids", "text": "Every parent knows the scenario: you say it’s time to leave the birthday party or playdate, and your kid starts to tantrum. Or, your kid faces a setback at school, and they’re so hard on themselves and say they never want to go to English class ever again. It can start even younger. You toddler’s friend takes their special stuffed animal, and chaos ensues.\n\nThese situations are emotional–but both kids and parents can learn skills to help manage all the big feelings that come up when you’re a kid, especially an emotionally sensitive kid. Studies have shown that kids who develop emotional regulation skills early on have better language skills and understanding of their emotions. Emotional regulation techniques have even been proven to help academic performance and maintain friendships.\n\nLearn about these useful skills that can help your kid regulate their emotions and behavior—and how to implement them in your family’s day to day life.\n\nWhat Is Emotional Regulation?\n\nEmotional regulation is defined as the ability to manage and react to emotional experiences. It is connected to both physical and mental health, and is a factor in preventing depression and anxiety. Mindfulness is key in emotional regulation: the ability to manage an emotional state hinges on a person’s understanding of their emotions.\n\nOf course, emotional dysregulation is the opposite, and in children can manifest in outbursts, hitting, and tantrums.\n\nWhen to Start Teaching Emotional Regulation Skills to Kids\n\nHelping children cope with stressors and day-to-day emotional fluctuations actually starts when a child is born, explains Rachiit Bhatt, PsyD at Intermountain Primary Children’s Hospital.\n\n“While infants cannot regulate emotions on their own, responding with warmth and structure during distressing moments is correlated with stronger abilities to self-regulate in their later years,” Dr. Bhatt says.\n\nWhile children under the age of four might have trouble managing their emotions and lack some expressive language skills, they rely on parents to provide a safe, emotionally receptive environment to diffuse any external stressors. As they reach school age, however, things begin to shift dramatically.\n\nAt age 2, children may have frequent tantrums that parents will have to mediate for them–responding with self-control and support instead of frustration and an outburst of their own. Eventually, however, children should start to recognize and regulate their emotions.\n\nBy the time your child is 6, they’re able to fully express their emotional states, what they need from others, and can start using techniques parents have modeled from birth.\n\nRachiit Bhatt, PsyD “Children start developing an emerging ability to self-regulate their emotions around age 5 and can benefit from direct teaching of specific skills.\" — Rachiit Bhatt, PsyD\n\nBenefits of Teaching Kids Emotional Regulation Skills\n\nTeaching your kids to cope with their emotions is vital, Dr. Bhatt explains, because it sets them up for future success when tough situations arise. Here are just a few of the most important benefits of emotional regulation.\n\nDecreases meltdowns and outbursts\n\nKids who can manage their emotional states often have fewer outbursts, Dr. Bhatt says. Productive conversations about emotions help parents understand what their children are going through in school and in life, instead of simply reacting to hidden stressors that often take the form of emotional outburts.\n\nImproves academic success\n\nResearch has shown that kids who are taught emotional regulation skills are better able to handle school stress. This helps kids get better grades and integrate into the school environment, easing transitions whether moving up a grade or into a new school.\n\nImproves social skills\n\nEmotional understanding has been shown to improve interpersonal social skills. Kids who better understand their emotions are able to relate to others—building stronger social bonds and developing friendships.\n\nHelps prevent depression and anxiety\n\nKids who develop emotional regulation skills tend to be happier and better regulated in the face of stress. This resilience means that when they are sad, they are more likely to recognize the cause of the emotion and seek help from parents or other adults.\n\nEmotional Regulation Skills to Teach Kids\n\nEmotional regulation is a skill that can be taught. Parents can model skills to their children, setting them up for success.\n\nIdentifying and labeling emotions\n\nChildren can be taught to notice and label their emotions from a young age. Using a “feelings chart” develops an awareness of the range of emotions and intensities a child can feel while also providing language to articulate an emotional state.\n\nBreathing exercises\n\nBreathing slowly and evenly can help slow an elevated heart rate, and bring a sense of calm to an agitated state of mind—plus, pausing to practice slow, deep breaths helps kids connect to, and understand, bigger emotions. Parents can model slow, even, meditative breathing for times of intense emotion. Somatic exercises are a great choice as they reconnect mind and body.\n\nMindfulness techniques\n\nAll kinds of mindfulness techniques, from practicing yoga with your children to meditating together, can help regulate emotions. Younger kids process bigger emotions in their bodies, so sitting quietly with those emotions can help them identify and regulate them.\n\nJournaling\n\nDr. Bhatt says that an important technique for older children can be writing down their emotions. By writing, we understand emotions better. “In order to regulate our emotions, it is important to recognize where they come from,” she adds.\n\nStrategies for Teaching Emotional Regulation to Kids\n\nEmotional regulation skills aren’t learned overnight. They’re the result of a consistent effort on parents’ part to teach kids what emotions are and how to understand them. Here are some easy ways to help your kids develop their emotional regulation toolkit.\n\nHave a meal together\n\nFamily mealtimes are a great opportunity for parents and children to share their emotions. Games like Rose, Thorn, Bud are helpful. Each person goes around the table and reveals three aspects of their day: The rose as a stand-in for the best part of a day, the thorn as the worst, and the bud as something you or your child is excited about.\n\nNighttime routine\n\nDr. Bhatt says sleep is vital to emotional regulation—and developing a consistent routine for bedtime helps your child process their emotions. Reading books at bedtime about emotions, too, can be helpful. The Boy with Big, Big Feelings by Britney Winn Lee is a great book to start with.\n\nModeling emotional regulation\n\nParents who model emotional regulation skills can help kids develop their own. “Modeling emotional regulation as a parent can be helpful for children to know what to do in stressful situations and allows them to better use their skills in distressing moments,” Dr. Bhatt says.\n\nTalk and teach about emotions\n\nEmotions are prickly, difficult things to identify sometimes, and it’s always good to have open conversations about emotions. Talk to children about the times you yourself felt confused about your emotions—and about how you gained clarity.\n\nValidation of emotions\n\nOften, it is easy for parents to dismiss a child’s emotions as overreactions or “childish,” but Dr. Bhatt explains that simply listening and accepting what your child is going through can teach them regulation as you provide a safe place to express themselves.\n\nChallenges of Teaching Emotional Regulation Skills to Kids\n\nEmotional regulation doesn’t develop overnight—and parents should try and recognize that their child is on a long path to emotional maturity. Some children might have more trouble than others, and young children might not yet be ready to learn all the tools.\n\nAt times, Dr. Bhatt says, it may feel like validating your child’s difficult emotion is condoning poor behavior—but that’s not true.\n\n“Validation does not excuse", "domain": "www.parents.com"}