{"url": "https://healthmatters.nyp.org/how-parents-can-help-their-kids-make-strong-friendships/", "title": "How Parents Can Help Their Kids Make Friends", "text": "How Parents Can Help Their Kids Make Friends A psychologist shares ways parents can support social skills and help their kids form and maintain friendships. 10 Min Read\n\nMaking friends is an essential part of growing up. Friendships give children a sense of connection and belonging, and studies have shown that learning social skills reduces the risk of bullying, leads to better school functioning and academic achievement, and increases the chances of employment later in life. “We know that having people in your corner is important, and what friendship looks like might vary depending on the child,” says Dr. Michelle Gorenstein-Holtzman, a clinical psychologist at NewYork-Presbyterian’s Center for Autism and the Developing Brain. “I tell parents it’s the quality of friendships that matter, not the quantity.” But children may struggle with making and maintaining friendships for many different reasons; and parents of neurodiverse children may find it especially challenging to help their children find people they can connect with. Health Matters spoke with Dr. Gorenstein-Holtzman about the challenges kids may face when forming friendships and shared simple ways that parents can offer support.\n\nDr. Michelle Gorenstein-Holtzman\n\nHow should very young children learn about friendships and practice their social skills?\n\nDr. Gorenstein-Holtzman: At the kindergarten and preschool age, children may be interacting for the first time with their peers. As children learn to take turns, share, and navigate social interactions, we can sometimes see behaviors such as hitting, biting, or taking a toy away from another child. These behaviors are developmentally appropriate to some extent. The more they can practice, the easier it gets. For younger kids, structured play dates — like playing a board game, doing an arts and crafts project, or baking together — are helpful, versus saying, “OK, here are all the toys, pick something.” And if your child gets frustrated, have them take a break. Also, if you know there are toys and games that are triggers for your child, move them out of sight from a playdate. Try to set you child up for success. What if your child is shy?\n\nFor shy children, it’s about building confidence. Put them in situations where they can be socially successful. You don’t want them in a group with all extroverts or kids who have really big personalities, as it will be even harder for a shy child to jump in. Family relationships can also be important. If your child is struggling or not getting invited to parties or playdates, try making weekends fun with cousins or relatives. Does it help to coach your child on how to navigate social situations?\n\nThis is where we see a difference between neurotypical and neurodiverse children. Neurotypical children will learn social skills implicitly — they observe other individuals interacting and imitate behavior or they do something once, get a not-so-great response, and learn not to do it again. For many neurodiverse children, social skills need to be taught explicitly. I don’t think there’s ever a negative in preparing children for a new situation or giving them language to use in a social setting. This does not mean that parents need to stand over their child and evaluate everything they do or say. If you are going into a social situation, do some pre-teaching. For example, before a get together, remind your child what sharing means, how it looks, and why it’s an important skill. Help them come up with some ways to approach people, like, “Hi, do you want to play Connect Four or soccer?” What if your child doesn’t seem to click with their classmates?\n\nIn the kindergarten years, the message in our society is, you have to be friends with everybody. Of course, we have to be respectful and kind, but just because we’re in the same environment doesn’t mean we’re going to click with everybody, and that doesn’t mean something’s wrong with you. Kids are going to be much more excited to make friends with peers who share the same passions. If it’s dinosaurs, see if the local museums or science programs have a group for kids their age. I’ve had several kids who are super interested in animals volunteer at their local animal shelter.\n\nGames That Help Your Kids Learn Social Skills Play board games to practice how to stop, wait, and take a turn. Simon Says, Bingo, and Zingo encourage listening skills.\n\nWrite a comic strip. Use thought bubbles and speech bubbles to anticipate a social interaction or rewind on a conversation that didn’t go well.\n\nMake “conversation balls” that have questions written on different sides of a ball. Toss the ball to each other and depending on where you catch it, answer that question.\n\nRole-play different social situations. Practice how to greet someone, make a comment, stay on topic, and end a conversation\n\nWhat if a child connects better with adults than peers?\n\nI see this a lot in children with autism whom I work with. If you think about it, it makes sense. Adults are more predictable. If you start talking to an adult and they are bored, they are not going to walk away mid-sentence. Also, some children might have more cerebral interests than their peers. I have worked with children in nursery school and kindergarten who are interested in the periodic table or human anatomy. While these are cool interests, they might not be what their classmates are talking about at recess. If your child says they want more same-aged peers, that’s where finding clubs and groups around their interests can help. What’s most important is that they feel connected to others and have a support network. What are some other challenges neurodiverse children might have when making and maintaining friends?\n\nKids who have ADHD may lose focus in conversations or miss social cues, and then respond in an unexpected way. They need help learning how to focus and attend to social cues, so when they respond in a socially positive manner, provide positive reinforcement — for instance, in the form of verbal praise. For children with autism, there’s a core difficulty with social skills; they struggle knowing what to say, how to say it, and how to respond. But just because somebody can’t learn social skills implicitly doesn’t mean that they can’t improve on them. I like to give children tools, structure, and prompts to help them develop the skills needed to engage with others and to meet their personal social goals. What if a child only has online friendships?\n\nTechnology has allowed children who struggle socially to make meaningful connections. Many teens and adults on the autism spectrum find online social interactions less physically and mentally draining because they don’t need to focus on nonverbal communication. That being said, I also have lots of parents who say, “I don’t want my child online so much.” I think this is where balance is important, and listening to what the child is saying is important. If a child can have in-person friendships and wants in-person friendships, then supporting them with that will be important.\n\nParents should recognize that socializing is a skill like anything else, and we need to support our child in learning it. Dr. Michelle Gorenstein-Holtzman", "domain": "healthmatters.nyp.org"}