{"url": "https://www.parents.com/toddlers-preschoolers/development/social/social-skills-activities-for-kids-to-do-at-home/", "title": "14 Ways to Build Your Child's Social Skills From Home", "text": "Children naturally learn to socialize by being physically present amongst other children. But, what about when kids can't be with their peers due to illness or school closures? How can they learn social skills from home to guide them from kindergarten to college?\n\n\"Everyone can learn reading, writing, and math from home,\" says Jaclyn Shlisky, Psy.D., a clinical psychologist and mom of three, including a kindergartener who she homeschooled during the COVID-19 pandemic school closures. \"While it's not ideal, it is doable, but social skills come naturally for kids through modeling and the experience they get when they're in a classroom setting and on a playground or interacting with other adults, like teachers.\"\n\nRead on to learn the importance of teaching social skills, and how to incorporate these lessons from home when your child isn't in school.\n\nWhat Are Social Skills?\n\nAccording to the American Psychological Association (APA), social skills are learned abilities for interacting appropriately in different social situations. These include things like making friends, resolving interpersonal conflicts, communication, and regulating feelings and behavior.\n\nAround the kindergarten age, social skills become the building blocks for what kids rely on to help them navigate the world around them. These are a few of the big ones children learn in the classroom environment:\n\nHow to deal with disappointment\n\nShowing emotion\n\nHow to respond to people (other than immediate family)\n\nTaking turns\n\nMaking eye contact\n\nListening without interrupting\n\nPlaying fairly\n\nSharing\n\nAccepting winning or losing (how to be a \"good sport\")\n\nUsing appropriate manners and greetings\n\nWhile people are not able to do all these things in isolation, parents can try to pick up the slack of what kids are missing by engaging in targeted play at home that can be just as beneficial to their social awareness.\n\n\"Something as simple as having a virtual playdate with a classmate can teach your child so much,\" says Francyne Zeltser, Psy.D., a child psychologist on Long Island, New York. During a video call, kids have to make eye contact, wait their turn, and demonstrate the body language to show that they are listening. In this way, Dr. Zeltser says you can turn your day-to-day in-person and virtual interactions into teachable moments.\n\nBut, teaching can be more intentional and activity-based, too. Below are some social skills activities you can do with your kids at home. Give them a try and have some fun with it too.\n\nRELATED: Little Ways to Encourage Your Child to Speak Their Mind\n\nPerspective-Taking\n\nThis is an easy activity all about identifying the feelings and thoughts of others and you can do it when you are watching TV or a movie with your child, suggests Dr. Shlisky. Press pause and say to your child, \"How do you think that he or she feels right now? What are they thinking?\" Let your child respond and then you can also provide your own answer, \"I think they feel scared because they are being chased\" or \"I think they feel happy because I see the rain is stopping and they can go outside.\"\n\n\"It's important to let your child practice identifying the thoughts and feelings of others,\" Dr. Shlisky adds. You can also do this while doing role play activities or acting games. You can have a puppet show and have the puppets talk to each other about their feelings and thoughts. The Good Dinosaur, The Incredibles and Inside Out are great film options for talking through emotions and feelings.\n\nCharacter Play\n\nGet out a bunch of character toys, like Peppa Pig or Barbie dolls, and have them pretend to talk to each other. Maybe you have a toy kitchen and your characters can pretend to bake a cake and have a pretend birthday party together.\n\nUse language like, \"what do you say to a friend when it's their birthday?\" Then listen to your child's answer and respond, \"That's right, we say, happy birthday! I hope you have a great day today!\"\n\nIf your child is someone who jumps to the front of the line to help blow out the candles, take this time to role play with the character toys how the birthday child feels when that happens. \"Use this game as a way to work on the things you feel like your child needs a little extra help with,\" Dr. Shlisky adds.\n\nTaking Turns\n\nEven for those who only have one child, you can still practice taking turns with your children. Take out a coveted toy that maybe only gets used on special occasions or come up with a unique item that your kids always want to touch, like the family Polaroid camera. You can give the item to one child and say they get to use it for five minutes and then set a timer and switch it over to the other siblings when their turn is over.\n\nPlaying Board Games\n\nWhile playing board games is probably the most obvious way to practice and encourage social skills, it's really the best bang for your buck. Dr. Shlisky says playing a game requires a lot of social skills including:\n\nPatience in waiting and taking turns\n\nNegotiation about who goes first (or what character piece or color you are)\n\nAgreeing to and sticking to the rules\n\nBeing a good sport whether you win or lose\n\nSome of the most popular games for optimal social skill learning are Candy Land, Jenga, Apples To Apples Jr., and Connect 4. But card games like Go Fish and UNO are also excellent academic games too.\n\nDr. Shlisky advises making sure the game is age appropriate for your child—if it is too hard or has too many instructions, your child will get bored and give up and they won't absorb the skills you really want them to get from playing the game in the first place. So it's best to keep it simple and fun.\n\nFaceTime or Virtual Playdates\n\nIt's a novel concept to \"play\" with a friend over your phone or a computer, but lots of social activities can be done simultaneously from inside your own homes and can give the same sense of \"togetherness\" your children crave. Coloring and arts and crafts are ways that your child can do something at the same time as their friend. They can discuss what they're working on with one another and will likely have side conversations, too.\n\n\"When our children are on playdates at the park or during recess, they can be involved in group play without fully attending to or engaging with their peers; they can even be zoning out during conversations,\" says Dr. Zeltser. \"Distance learning and virtual communication teaches children how to take turns talking, how to ask questions in order to be involved in conversations, and how to consistently use greetings like 'hello' and 'goodbye.'\"\n\nScavenger Hunts\n\nScavenger hunts can be done virtually with your child and their friend at their home or just with your child at home. Instead of telling your child to find items that are scattered throughout your house, come up with a riddle that your child has to solve with their friend. An example riddle might be, \"I come in different shapes and sizes, can be found in the kitchen or the bathroom, and can be adjusted to be hot or cold, what am I?\" (Answer is a sink!)\n\nThough it may take a little work on your end, your child and their buddy will have a chance to work on their cooperation skills with this game. \"This is a great opportunity for your child to really work together with another person and come up with an answer as a team,\" says Dr. Zeltser.\n\nWould-You-Rather Game\n\nWould-you-rather is a silly game that lets kids laugh and let loose while using their imagination and creativity. Your child needs to come up with two goofy or outlandish statements, making you (or a friend who is playing virtually) choose an answer no matter how ridiculous the options.\n\nThis game brings on the giggles but also encourages children to think outside the box and ask follow up questions. You never know what topic or feelings you might start discussing when you play this game! (Some favorites to start your kid off that could have interesting follow-up chats after the game is over are, \"Would you rather be able to fly ", "domain": "www.parents.com"}