{"url": "https://childmind.org/blog/how-pretend-play-helps-children-build-skills/", "title": "How Pretend Play Helps Children Build Skills", "text": "By Kathryn L. Keough, PhD\n\nPsychologist, Anxiety Disorders Center\n\nChild Mind Institute\n\nPretend play, also known as imaginative play, includes a range of imaginative behaviors and actions that become more complex over early childhood (Lillard et al., 2011). Two-year-old children begin to act out scenarios with stuffed animals, dolls, or figures, and they initially gravitate towards realistic toys, using them to mimic familiar events (Smith, 2009). For instance, a two-year-old may play by having their stuffed dog walk and drink out of a bowl.\n\nSymbolic play emerges around age three. This involves using one object as another or pretending an object has different properties than it actually has (Lillard, 2015). This might look like a child pretending a box is a crib for their babydoll, having their block creation “meow” as a cat, or imagining an empty bowl is full as they feed their animal figurines.\n\nBeyond age three, pretend play becomes more complex and social in nature. Children begin to incorporate imaginary objects, create more detailed narratives and fantasy worlds, and engage in dramatic role-play with peers (Smith, 2009). Ages three to five are considered the “high season” of imaginative play, though pretend play continues into middle childhood (Singer & Singer, 2009; Smith & Lillard, 2012).\n\nBenefits of Pretend Play\n\nEmotional skills\n\nPretend play has the potential to create a context in which young children can develop various emotional skills through exploration and practice. Research suggests that emotion knowledge and regulation skills are better developed among young children who engage in more frequent pretend play and demonstrate a stronger preference for fantasy-based play and thoughts (Bauer et al., 2021; Galyer & Evans, 2001; Gilpin et al., 2015; Lindsey & Colwell, 2013). These findings support the notion that pretend play provides an opportunity to exercise emotional control skills. Children may develop these skills through role-playing in pretend play, for instance, by expressing differing emotions than those they are feeling in order to stay in character or fit the play situation.\n\nA study examining the neural activity during play in young children found that the brain region associated with social processing and empathy was more active in children playing alone with dolls than on a tablet, whereas the neural activity level did not differ between doll or tablet play when children played with someone else (Hashmi et al., 2020). This suggests that pretend play with dolls provides a way for children to practice social and empathic skills even when playing by themselves.\n\nIn consideration of the potential emotional skill benefits, a program incorporating dramatic pretend play has been developed for children at risk of social-emotional and regulation skill delays, and results indicated that emotion control was improved among children who participated in the program (Goldstein & Lerner, 2018).\n\nSocial skills\n\nPretend play also provides opportunities for children to build and practice social skills. Children who engage in more frequent and higher-level pretend play have been found to have more advanced understandings of other’s mental states, or theory-of-mind (Lillard et al., 2011; Youngblade & Dunn, 1995). There is also research that suggests that pretend play with peers is positively associated with social skills like cooperation and assertiveness (Li et al., 2016). Pretend play with peers also supports social competence and the development of other prosocial skills like turn taking, perspective taking, and friendship formation (Smith, 2009; Smits-van der Nat et al., 2024).\n\nCreativity\n\nPretend play appears to facilitate the creative thinking process in children (Russ & Wallace, 2013). A review of the evidence on the play-creativity hypothesis examined the impact of either pretend play training or pretend play time on a subsequent creativity task. Siverman (2016) found that the play-creativity hypothesis, which posits that one function of pretend play is to facilitate the creative thinking process in children, is likely true.\n\nExecutive functioning\n\nRecent evidence suggests that pretend play can improve executive functioning, which are the skills that help people self-regulate, plan, and achieve goals (White et al., 2021). Children who engaged in pretend play have demonstrated improvements in inhibitory control, memory span, cognitive flexibility, and task persistence (Bauer et al., 2021; White & Carlson, 2021, White et al., 2017, White et al., 2021).\n\nA study examining the impact of play on executive function developed a five-week fantasy-play intervention in which small groups of children were encouraged to come up with a fantastical script and act it out (Thibodeau et al., 2016). Compared to children in the non-imaginative play and control conditions, children who engaged in fantastical pretend play showed improvements in working memory and attention shift performance. This suggests that fantasy-oriented play can directly enhance children’s executive functioning skills.\n\nLanguage\n\nPretend play appears to support children’s language development. Symbolic play has been related to expressive and receptive language development (Lewis et al., 2000). Elaborative pretend play and use of symbols in play in preschool was found to predict semantic organization skills, which include categorization, comparison, classification and analogical reasoning, and narrative retelling abilities in up to five years later in the elementary years (Stagnitti & Lewis, 2015).\n\nSummary\n\nPretend play begins to emerge around age two, and it peaks in the preschool years. As pretend play becomes more complex, children use objects symbolically, role-play, create extended narratives, and engage with their peers through sociodramatic play activities. Pretend play has been associated with better developed emotion regulation, social, creativity, executive functioning, and language skills, but further methodologically rigorous research is needed to investigate the role pretend play has on development of these skill areas.\n\nReferences\n\nBauer, R. H., Gilpin, A. T., & Thibodeau-Nielsen, R. B. (2021). Executive functions and imaginative play: Exploring relations with prosocial behaviors using structural equation modeling. Trends in Neuroscience and Education, 25, 100165.\n\nGalyer, K. T., & Evans, I. M. (2001). Pretend play and the development of emotion regulation in preschool children. Early Child Development and Care, 166(1), 93-108.\n\nGilpin, A. T., Brown, M. M., & Pierucci, J. M. (2015). Relations between fantasy orientation and emotion regulation in preschool. Early Education and Development, 26(7), 920-932.\n\nGoldstein, T. R., & Lerner, M. D. (2018). Dramatic pretend play games uniquely improve emotional control in young children. Developmental Science, 21(4), e12603.\n\nHashmi, S., Vanderwert, R. E., Price, H. A., & Gerson, S. A. (2020). Exploring the benefits of doll play through neuroscience. Frontiers in Human Neuroscience, 14, 560176.\n\nLewis, V., Boucher, J., Lupton, L., Watson, S. (2000). Relationships between symbolic play, functional play, verbal and non-verbal ability in young children. International Journal of Language & Communication Disorders, 35(1), 117–127.\n\nLi, J., Hestenes, L. L., & Wang, Y. C. (2016). Links between preschool children’s social skills and observed pretend play in outdoor childcare environments. Early Childhood Education Journal, 44, 61-68.\n\nLillard, A. S. (2015). The Development of play. In L. S. Liben, U. Müller, & R. M. Lerner (Eds.), Handbook of child psychology and developmental science: Cognitive processes (7th ed., pp. 425-468). John Wiley & Sons, Inc.\n\nLillard, A. S., Pinkham, A. M., & Smith, E. (2011). Pretend play and cognitive development. In U. Goswami (Ed.), The Wiley-Blackwell handbook of childhood cognitive development (2nd ed., pp. 285–311). Wiley Blackwell.\n\nLindsey, E. W., & Colwell, M. J. (2013). Pretend and physical pla", "domain": "childmind.org"}