{"url": "https://www.cdc.gov/child-development/positive-parenting-tips/preschooler-3-5-years.html", "title": "Positive Parenting Tips: Preschoolers (3–5 years old)", "text": "Developmental milestones Skills such as naming colors, showing affection, and hopping on one foot are called developmental milestones. Most children achieve these milestones by a certain age. Children reach milestones in how they play, learn, speak, behave, and move. As children grow into early childhood, their world will open up as they explore and ask about the things around them. They will become more independent and begin to focus more on adults and children outside of the family. Their interactions with those around them will help to shape their personality and their own ways of thinking and moving. During this stage, children should be able to help dress and undress themselves, recall part of a story, and sing songs. Other examples of activities at this stage include playing with other children, riding a tricycle, and using safety scissors.\n\nPositive parenting tips Encourage your child to play with other children to help them learn the value of sharing and friendship. Following are some of the things you, as a parent, can do to help your preschooler during this time: Continue to read to your child. Nurture their love for books by taking them to the library or bookstore.\n\nLet your child help with simple chores.\n\nBe clear and consistent when disciplining your child. Explain and show the behavior that you expect from them. Whenever you tell them no, follow up with what they should be doing instead.\n\nHelp your child develop good language skills by speaking to them in complete sentences and using \"grown up\" words. Help them to use the correct words and phrases.\n\nHelp your child through the steps to solve problems when they are upset.\n\nGive your child a limited number of simple choices (for example, deciding what to wear, when to play, and what to eat for snack).\n\nChild safety first As your child becomes more independent, it is important that you and your child are aware of ways to stay safe. Here are a few tips to protect your child: Tell your child why it is important to stay out of traffic. Tell them not to play in the street or run after stray balls.\n\nBe cautious when letting your child ride their tricycle. Keep them on the sidewalk and away from the street and always have them wear a helmet.\n\nCheck outdoor playground equipment. Make sure there are no loose parts or sharp edges.\n\nWatch your child at all times, especially when they are playing outside.\n\nBe safe in the water. Teach your child to swim, but watch them at all times when they are in or around any body of water (this includes kiddie pools).\n\nTeach your child how to be safe around strangers. Car seat recommendations for children‎‎ Use a forward-facing car seat with a harness until your child reaches the top height or weight limit allowed by the car seat's manufacturer. Then it will be time to switch to a booster seat, but still in the back seat of the vehicle. Learn more: Car seat recommendations for children (National Highway Traffic Safety Administration)", "domain": "www.cdc.gov"}