{"url": "https://www.mayoclinic.org/healthy-lifestyle/infant-and-toddler-health/in-depth/tantrum/art-20047845", "title": "Temper tantrums in toddlers: How to keep the peace", "text": "Temper tantrums in toddlers: How to keep the peace Temper tantrums are part of growing up. Find out how to respond to temper tantrums and what you can do to prevent them. By Mayo Clinic Staff\n\nYou're shopping with your toddler in a grocery store. Your toddler spies a treat that you don't plan to buy. Suddenly you're in the center of a howling temper tantrum.\n\nWhat's the best response? Why do these meltdowns happen? Can you prevent them? Consider these tantrum tips.\n\nWhy do tantrums happen?\n\nFor young children, a tantrum shows feelings of frustration or anger. Perhaps they are having trouble finishing a task. Maybe they don't have the words to express their feelings. Their frustration might trigger an outburst that results in a temper tantrum.\n\nChildren who are tired, hungry or ill may have a lower limit for frustration. Times of change also can be hard. Tantrums are more likely in these situations.\n\nDo young children have tantrums on purpose?\n\nYoung children don't plan to upset or embarrass their parents. For toddlers, tantrums are a way to express how they feel. For older children, tantrums might be learned behavior. If you reward tantrums with something your child wants, the tantrums are likely to continue. This also is true if you allow your child to avoid things by throwing a tantrum.\n\nCan tantrums be prevented?\n\nThere might be no sure way to prevent tantrums. But there's plenty you can do to foster good behavior even in the youngest children.\n\nFor example:\n\nBe consistent. It's important to be consistent in how you respond to your child's behavior. Try to respond the same way when your child yells or cries. It can help to have a mantra: \"I will answer you when you stop yelling.\"\n\nTry not to change rules. If you don't buy treats at the store, keep it that way every time. Follow a daily routine with sleeping and eating. This helps ensure your child gets enough sleep and food for the child's age. Children who don't get enough rest and quiet time can become short-tempered.\n\nIt's important to be consistent in how you respond to your child's behavior. Try to respond the same way when your child yells or cries. It can help to have a mantra: \"I will answer you when you stop yelling.\" Plan ahead. Run errands when your child isn't likely to be hungry or tired. If you're expecting to wait in line, pack a small toy or snack to occupy your child.\n\nRun errands when your child isn't likely to be hungry or tired. If you're expecting to wait in line, pack a small toy or snack to occupy your child. Let your child make choices. Avoid saying no to everything. Try to give children a sense of control by letting them make choices. \"Would you like to wear your red shirt or your blue shirt?\" \"Would you like to eat strawberries or bananas?\" \"Would you like to read a book or build a tower with your blocks?\"\n\nAvoid saying no to everything. Try to give children a sense of control by letting them make choices. \"Would you like to wear your red shirt or your blue shirt?\" \"Would you like to eat strawberries or bananas?\" \"Would you like to read a book or build a tower with your blocks?\" Use positively worded directions. Focus on what your child should do rather than what the child shouldn't do. Try to explain the reason behind a request. For example, \"Please use your inside voice while we are inside so everyone can have fun together.\"\n\nFocus on what your child should do rather than what the child shouldn't do. Try to explain the reason behind a request. For example, \"Please use your inside voice while we are inside so everyone can have fun together.\" Praise good behavior. Offer extra attention when your child behaves well, and praise your child's efforts. Give your child a hug for sharing or following directions. Tell your child how proud you are for positive efforts and choices.\n\nOffer extra attention when your child behaves well, and praise your child's efforts. Give your child a hug for sharing or following directions. Tell your child how proud you are for positive efforts and choices. Avoid situations likely to trigger tantrums. Don't give your child toys that are far too advanced for the child's age. If your child begs for toys or treats when you shop, avoid tempting places or do these errands without your child. If your toddler acts up when you're out to eat, choose places that offer quick service.\n\nWhat's the best way to respond to a tantrum?\n\nTypically, the best way to respond to a tantrum is to stay calm. If you respond with loud, angry outbursts, your child might copy your behavior. Shouting at a child to calm down is likely to make things worse.\n\nInstead, it can help to redirect children to something else that may interest them. Offering a different book, moving to a new location or making a funny face might help. Try making tasks into a game: \"Let's see who can pick up the most toys.\"\n\nSometimes children will hit or kick during a tantrum. They may try to run out into the street. If this behavior is dangerous, calmly hold your child until your child calms down. If the child is upset but safe, sit with the child and show calm behavior until the tantrum subsides.\n\nWhen your child quiets down, calmly explain your rules.\n\nWhat if my child becomes destructive or dangerous?\n\nIf a tantrum goes from bad to worse, remove your child from the setting. It's time to enforce a timeout:\n\nChoose a timeout spot. Seat your child in a boring place, such as in a chair in the living room or on the floor in the hallway. Wait for your child to calm down. Consider giving one minute of timeout for every year of your child's age.\n\nSeat your child in a boring place, such as in a chair in the living room or on the floor in the hallway. Wait for your child to calm down. Consider giving one minute of timeout for every year of your child's age. Stick with it. If your child begins to wander around before the timeout is over, return him or her to the designated timeout spot. Don't respond to anything your child says while he or she is in timeout.\n\nIf your child begins to wander around before the timeout is over, return him or her to the designated timeout spot. Don't respond to anything your child says while he or she is in timeout. Know when to end the timeout. When your child has calmed down, briefly discuss the reason for the timeout. Talk about why the behavior wasn't correct. Then return to your usual activities.\n\nBut timeouts should not be the only tactic for stopping tantrums. Timeouts should be part of a broader approach that includes positive feedback and clear consequences for unexpected behaviors.\n\nWhen is professional help needed?\n\nAs your child's self-control improves, tantrums should become less common. Most children begin to have fewer tantrums by age 3 1/2. If tantrums get worse after age 4, talk with your child's healthcare professional.\n\nSometimes children harm themselves or others during a tantrum. They may hold their breath during tantrums to the point of fainting. A healthcare professional might be able to help you better understand issues causing these behaviors.\n\nThere is a problem with information submitted for this request. Review/update the information highlighted below and resubmit the form. Children’s health information and parenting tips to your inbox. Sign-up to get Mayo Clinic’s trusted health content sent to your email. Receive a bonus guide on ways to manage your child’s health just for subscribing. Click here for an email preview. Email Infant's First Year (0-1) Toddler (2-4) Elementary Children (5-10) Tween & Teen (11-17) Address 1 ErrorEmail field is required ErrorInclude a valid email address Subscribe Learn more about Mayo Clinic’s use of data. We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in our N", "domain": "www.mayoclinic.org"}