{"url": "https://www.healthychildren.org/English/healthy-living/sleep/Pages/healthy-sleep-habits-how-many-hours-does-your-child-need.aspx", "title": "Healthy Sleep Habits: How Many Hours Does Your Child Need?", "text": "Page Content\n\nFrom infants and toddlers to school-aged kids and teens, parents want to know how many hours of sleep are recommended. While it's true that sleep needs vary from one person to another, there are some very reasonable, science-based guidelines to help you determine whether your child is getting the sleep they need to grow, learn, and play.\n\n\n\nChildhood Sleep Guidelines\n\nThe American Academy of Sleep Medicine (AASM) provides some helpful guidelines regarding just how much sleep children need at different stages in their development. Keep in mind that these numbers reflect total sleep hours in a 24-hour period. So if your son or daughter still naps, you'll need to take that into account when you add up their typical sleep hours.\n\n\n\n\n\n\n\n\n\nDo those numbers surprise you?\n\nSo, are you sending your child off to bed early enough? If those numbers are surprising to you, you're not alone. Working and single parents, especially, are often forced to get by on 5, 6, or even fewer hours of sleep each night. This is likely impacting your own social and mental functioning, as well as increasing your risk for other health problems.\n\nIt might be tempting to think that your children can also get by with less sleep than they need, or that they should be able to cope fairly well with a few skipped hours here and there. However, all children thrive on a regular bedtime routine. Regular sleep deprivation often leads to some pretty difficult behaviors and health problems—irritability, difficulty concentrating, hypertension, obesity, headaches and depression. Children who get enough sleep have a healthier immune system, and better school performance, behavior, memory, and mental health.\n\nHealthy sleep habits: tips from the AAP\n\nThe American Academy of Pediatrics (AAP) supports the AASM guidelines and encourages parents to make sure their children develop good sleep habits right from the start.\n\nMake sufficient sleep a family priority. Understand the importance of getting enough sleep and how sleep affects the overall health of you and your children. Remember that you are a role model to your child; set a good example. Staying up all night with your teen to edit their paper or pulling an all-nighter for work yourself isn't really sending the right message. Making sleep a priority for yourself shows your children that it's part of living a healthy lifestyle—like eating right and exercising regularly.\n\nKeep to a regular daily routine. The same waking time, meal times, nap time and play times will help your child feel secure and comfortable, and help with a smooth bedtime. For young children, it helps to start early with a bedtime routine such as brush, book, bed. Make sure the sleep routines you use can be used anywhere, so you can help your child get to sleep wherever you may be.\n\nBe active during the day. Make sure your kids have interesting and varied activities during the day, including physical activity and fresh air. See Energy Out: Daily Physical Activity Recommendations for more information.\n\nMonitor screen time. The AAP recommends keeping all screens—TVs, computers, laptops, tablets and phones out of children's bedrooms, especially at night. To prevent sleep disruption, turn off all screens at least 60 minutes/1 hour before bedtime. Create a Family Media Use Plan and set boundaries about use before bedtime.\n\nCreate a sleep-supportive and safe bedroom and home environment. Dim the lights prior to bedtime and control the temperature in the home. Don't fill up your child's bed with toys. Keep your child's bed a place to sleep, rather than a place to play. One or two things—a favorite doll or bear, a security blanket—are okay and can help ease separation anxiety. See Suitable Sleeping Sites for more information specifically for babies under 12 months of age.\n\nRealize that teens require more sleep , not less. sleep-wake cycles begin to shift up to two hours later at the start of puberty. At the same time, most high schools require students to get to school earlier and earlier. The AAP has been advocating for middle and high schools delay the start of class to 8:30 a.m. or later. It is important that parents and local school boards work together to implement high school start times that allow teens to get the healthy sleep they need. See the AAP policy statement, School Start Times for Adolescents, for more information.\n\nDon't put your baby to bed with a bottle of juice, milk or formula. Water is okay. Anything other than water in the bottle can cause baby bottle tooth decay. Feed or nurse your baby, and then put him or her down to sleep.\n\nDon't start giving solids before about 6 months of age. Starting solid food sooner will not help your baby sleep through the night. In fact, if you give your baby solids before their system can digest them, he or she may sleep worse because of a tummy ache.\n\nAvoid overscheduling. In addition to homework, many children today have scheduled evening activities (i.e., sports games, lessons, appointments, etc.) that pose challenges to getting a good night's sleep. Take time to wind down and give your children the downtime that they need.\n\nLearn to recognize sleep problems. The most common sleep problems in children include difficulty falling asleep, nighttime awakenings, snoring, stalling and resisting going to bed, sleep apnea and loud or heavy breathing while sleeping.\n\nTalk to your child's teacher or child care provider about your child's alertness during the day. Sleep problems may manifest in the daytime, too. A child with not enough, or poor quality sleep may have difficulty paying attention or \"zoning out\" in school. Let your child's teacher know that you want to be made aware of any reports of your child falling asleep in school, as well as any learning or behavior problems.\n\nTalk to your child's pediatrician about sleep. Discuss your child's sleep habits and problems with your pediatrician, as most sleep problems are easily treated. He or she may ask you to keep a sleep log or have additional suggestions to improving your child's sleep habits.\n\nMore information\n\n", "domain": "www.healthychildren.org"}