{"url": "https://www.parents.com/expert-approved-sneaky-tips-to-get-your-kid-reading-11810979", "title": "13 Expert-Approved 'Sneaky' Tips to Get Your Kid Reading", "text": "If you have a reluctant reader at home—or a child who simply does not enjoy reading—you are not alone. In fact, a study of 9.9 million students by Renaissance Learning found that more than half of all the students read less than 15 minutes per day. And, when this happens, researchers say it puts young people at risk for reading challenges and literacy concerns, especially because reading gains can fall to below average when kids aren’t regularly engaging with books.\n\nReading for pleasure is not just about literacy, though. It can impact other areas of academics, too, says Niyoka McCoy, EdD, chief learning officer at Stride, Inc. “Reading for pleasure in early childhood has a significant impact on cognitive test results in adolescence, including improvements in academic achievement, memory, speech development, comprehension, and verbal learning.”\n\nTo help bolster your child’s daily reading time, sometimes it takes a little creativity—and maybe even a bit of mischief—to make reading fun and build up those minutes. Here are 13 ways to get your kids to read that do not involve forcing them to sit down with a chapter book. Plus, these tips might just help foster a love for reading that they can carry with them into adolescence and beyond.\n\nPair Books With Activities\n\nMake stories come alive by tying them to hands-on fun, suggest McCoy. “Reading Charlotte’s Web? Visit the local petting zoo to meet farm animals. Reading Cloudy With a Chance of Meatballs? Watch the movie afterward and cook up a spaghetti night. These kinds of connections help stories stick—and make reading feel like an adventure.”\n\nShe says you can change the narrative and reignite a love for reading in your child. But it’s crucial to act now to reverse any reluctance to read. “Reading regularly isn’t just about test scores; it also helps children build empathy, creativity, language skills, and confidence.”\n\nMake “Top-Secret” Family Announcements\n\nPost household updates, weekend plans, and upcoming birthdays, in sealed “confidential” envelopes, says Kristen Miller, a 20-year veteran educator and director of education for Celebree School. The only way your kids can access the information is by reading, which adds an air of intrigue to every sentence, she says. Plus, it makes reading exciting and fun.\n\n“Not every child connects with books the same way,” says Miller. “Some feel overwhelmed by too many words on a page, others haven’t yet found a topic that excites them, and many simply see reading as schoolwork. Creative strategies reframe reading as play, curiosity, or even a puzzle to solve, meeting kids where they are instead of forcing them into one rigid model.”\n\nTurn Reading Into a Shared Activity\n\nMcCoy suggests choosing a book to read aloud together— just a few minutes each day. “You’ll be modeling fluent reading, building vocabulary, and carving out meaningful time with your child.”\n\nAnd, when you are road-tripping or heading to sports practices, she says you can download an audiobook from your local library and enjoy a story together in the car. “Audiobooks improve listening comprehension and introduce your child to rich vocabulary—even if they’re not yet ready to read more advanced texts on their own.”\n\nCreate a “Reading Passport” Challenge\n\nEncourage your child to “travel” through books by creating a passport, says McCoy. “Every time they finish a book, have them stamp their passport with the story’s setting—like the beach, outer space, or a different country. For local flair, include books set in your area or state or written by local authors.”\n\nYou also could encourage them to choose their own books, she says. “Whether it’s a graphic novel, mystery series, cookbook, or sports biography, giving your child the power to choose increases their excitement to read. Stop by your local library, and let your child browse the shelves.”\n\nUtilize Closed Captioning and Karaoke Lyrics\n\nPull up the printed lyrics of a popular song and have them “own” the mic in a karaoke challenge, suggests Miller. “Singing forces kids to track text rhythmically, making fluency and expression feel like part of the game.”\n\nYou also can put closed captioning on the television or iPad when watching a movie or favorite television program. This allows kids to read along while people are speaking. It also can be helpful for kids with dyslexia, says James Cox, interim assistant library director, at Hoboken Public Library in Hoboken, New Jersey.\n\n“My daughter has dyslexia and we watch everything with captions on,” he says. “That was recommended by a reading specialist. It has helped her connect words she hears with what she sees, and it has made reading part of our daily life without feeling like homework.”\n\nCombine Reading With Their Favorite Activities\n\nAll reading counts, says Jennie Pu, library director at the Hoboken Public Library. “I tell my soccer-obsessed son that reading news updates about his favorite teams and players counts as reading. and he reads a lot of sports related news.”\n\nLikewise, Shara Arora, an AMS-certified Montessori early childhood teacher and executive director of two Montessori preschools in the Houston area, says her son also is obsessed with sports. “When he watched a game and asked about a team or player, I’d have him sound out and read the names to the best of his ability. I also found beginner reader books about sports so he would be more inclined to try and read.”\n\nUse Visual Cues With Words\n\nArora says in their Montessori classrooms, they label everyday objects like chair, shelf, table, sink, cubby, and so on. “You can do the same at home. It’s a passive way to expose kids to words and help them make natural connections.”\n\nAt home, she created interactive shopping lists for her kids when they were younger. “We made grocery lists in picture-and-word format. At the store, my kids would read off what we needed and cross it off once it went in the cart.”\n\nGo Wordless\n\nWordless picture books are powerful tools for young readers because they build storytelling skills, strengthen vocabulary, says Lindsay Koch, EdD, associate professor of education at Lebanon Valley College.\n\nAs kids describe what they see on the pages, Koch says this encourages critical thinking because they make predictions and notice detail while they learn to “read” the pictures for meaning. “[It also] helps foster confidence by removing reading-level barriers and allowing kids to take ownership of the storytelling.”\n\nCombine Cooking and Dining Out With Reading\n\nGive your child the role of “order manager” when you’re eating out or even ordering delivery, suggests Miller. “Have them read the menu, highlight specials, and place the order. Ownership—and a bit of responsibility—makes them eager to decode every word.”\n\nCookbooks are another way to encourage reading and have an added benefit of learning math, says Aimee Harris, information and digital services manager at Hoboken Public Library. “My son loved baking when he was in elementary school. Reading through each recipe was essential to make sure we got all the steps and ingredients right. Plus we'd use math for things like making 1/2 cup with only a 1/4 cup, so it was an additional learning opportunity.”\n\nYou can even turn cooking into a game by creating mystery recipe cards, adds Miller. “Print or handwrite recipe steps but leave key ingredients as blanks they have to ‘unlock’ by reading the pantry labels. This turns cooking into a decoding game, with the reward being dessert or dinner they helped make.”\n\nCreate Treasure Maps or Scavenger Hunts\n\nHide a toy or treat and make a treasure map, suggests Karla Aybar Reyes, chief of staff at the Hoboken Public Library. Then, make sure some things aren’t marked with pictures, but with words. “If [your child] wants to find the treasure, they need to read the words.”\n\nAlso, make sure you use simple words and clues to ensure their success. “Reading easier texts gives kids a sense of success and builds confidence as readers,” says", "domain": "www.parents.com"}