{"url": "https://www.stanfordchildrens.org/en/topic/default?id=separation-anxiety-disorder-in-children-90-P02582", "title": "Separation Anxiety Disorder in Children", "text": "Separation Anxiety Disorder in Children\n\nWhat is separation anxiety disorder in children? Separation anxiety disorder (SAD) is a type of mental health problem. A child with SAD worries a lot about being apart from family members or other close people. The child has a fear of being lost from their family or of something bad occurring to a family member if they are not with the person. All children and teens feel some anxiety. It is a normal part of growing up. Separation anxiety is normal in very young children. Nearly all children between ages 18 months and three years old have separation anxiety. They are clingy to some degree. But the symptoms of SAD are more severe. A child must have symptoms of SAD for at least 4 weeks to be diagnosed with SAD. A child with SAD has worries and fears about being apart from home or family that are not right for their age.\n\nWhat causes separation anxiety disorder in a child? Experts believe SAD is caused by both biological and environmental factors. A child may inherit a tendency to be anxious. An imbalance of 2 chemicals in the brain (norepinephrine and serotonin) most likely plays a part. A child can also learn anxiety and fear from family members and others. A traumatic event may also cause SAD.\n\nWhich children are at risk for separation anxiety disorder? SAD happens equally in males and females. But children who have parents with an anxiety disorder are more likely to have SAD.\n\nWhat are the symptoms of separation anxiety disorder in a child? The first symptoms of SAD often appear around the third or fourth grade. They may start after a break from school, such as during holidays or summer. Or after a long-term sickness. Each child may have different symptoms. But the most common signs of SAD are: Refusing to sleep alone\n\nRepeated nightmares with a theme of separation\n\nLots of worry when parted from home or family\n\nToo much worry about the safety of a family member\n\nToo much worry about getting lost from family\n\nRefusing to go to school\n\nFear and reluctance to be alone\n\nFrequent stomachaches, headaches, or other physical complaints\n\nMuscle aches or tension\n\nToo much worry about safety of self\n\nToo much worry about or when sleeping away from home\n\nBeing very clingy, even when at home\n\nPanic attacks or temper tantrums at times of separation from parents or caregivers The symptoms of SAD may look like other health problems. Make sure your child sees their healthcare provider for a diagnosis.\n\nHow is separation anxiety disorder diagnosed in a child? Your child's healthcare provider will do a physical exam. This is to rule out physical problems that could be causing your child's symptoms. If your child has no physical problems, a child psychiatrist or other mental health expert can diagnose SAD. They will do a mental health assessment of your child. For your child to be diagnosed with SAD, their worry or fear about being away from family members must last for at least 4 weeks.\n\nHow is separation anxiety disorder treated in a child? Treatment will depend on your child’s symptoms, age, and general health. It will also depend on how severe the condition is. Treatment for SAD often involves a mix of the following: Cognitive behavioral therapy. This treatment helps a child learn how to better handle their anxiety. The goal is also to help a child master the situations that may lead to the anxiety.\n\nMedicines. Antidepressant or antianxiety medicine may help some children feel calmer.\n\nFamily therapy. Parents play a vital role in any treatment.\n\nSchool input. A child’s school may also be involved in care.\n\nHow can I help prevent separation anxiety disorder in my child? Experts don’t know how to prevent SAD in children and teens. But if you notice signs of SAD in your child, you can help by seeking an assessment as soon as possible. Early treatment can lessen symptoms and enhance your child’s normal development. It can also improve your child’s quality of life.\n\nHow can I help my child live with separation anxiety disorder? As a parent, you play a key role in your child’s treatment. Here are things you can do to help: Keep all appointments with your child’s healthcare provider.\n\nKeep the promises you make to your child. Your child's trust and independence will increase when you stick to your promise of return.\n\nPractice short \"away times\" with people your child trusts. For instance, a short playdate with a friend. Or a visit to grandma's house.\n\nShow your child reassurance and support. Encourage age-appropriate independence.\n\nRecognize situations that may stress your child. Knowing what stresses your child and planning ahead can help you prepare your child so they are successful.\n\nTell others about your child’s SAD. Work with your child’s healthcare provider and school to create a treatment plan. Remind teachers that your child will need extra reassurance and support in certain situations.\n\nGet individual therapy if you have an anxiety disorder. Also consider family therapy.\n\nReach out for support from local community services. Being in touch with other parents who have a child with SAD may be helpful.\n\nContact your child's healthcare provider if symptoms increase or new symptoms occur.\n\nKey points about separation anxiety disorder in children SAD is a type of mental health problem. A child with SAD worries a lot about being apart from family members or other close people.\n\nThe cause of SAD is both biological and environmental.\n\nPhysical problems should be ruled out before a diagnosis of SAD is made.\n\nSymptoms of SAD are more severe than the normal separation anxiety that nearly every child has to some degree between the ages of 18 months and 3 years of age.\n\nA child must have symptoms that last at least 4 weeks to be considered SAD.\n\nA mental health evaluation is needed to diagnose SAD.\n\nTreatment includes therapy and medicines.\n\nIf parents are also anxious, individual therapy for the parents and family therapy may also be helpful\n\nCoordination with caregivers and school personnel can help the child cope with their anxiety", "domain": "www.stanfordchildrens.org"}