{"url": "https://sunshine-parenting.com/10-friendship-skills-every-kid-needs/", "title": "10 Friendship Skills Every Kid Needs", "text": "As parents and adults who work with youth, we can positively impact kids’ lives through helping them build good social skills, which are, I believe, more important than academic or athletic skills. At school, very little—if any—time is spent teaching these important skills, but for youth who struggle with social skills deficits, this attention is vital.\n\nDeficits in social skills are linked to a myriad of problems for youth and adults, while healthy social skills are associated with many positive life outcomes. Therefore, it behooves us to teach social skills to youth.\n\nBut where do we start?\n\nListen to Episode 2 of the Sunshine Parenting Podcast: 10 Friendship Skills That Every Kid Needs.\n\nOne place is with a quick assessment of which of the following ten skills need the most strengthening, then pick just one to work on at a time. As you introduce a skill, be positive and not condemning or critical.\n\nSay something like, “Making friends can be hard sometimes. I’d like to talk with you about something you can do that will help you make friends. How does that sound?”\n\nFind the right “tribe” One of the most important social skills is the ability to discern who might be a good friend. Kids need to find other kids who accept who they are, consider them an equal, and share some of the same interests. Some kids try to join the perceived “popular” group only to find they are not truly welcome. Such “friendships” are lopsided and unfulfilling, and in fact, often only one child (usually the one not being accepted) considers the friendship viable and is investing in it. Rather than encouraging children to continue forcing themselves into a friendship or group where they are not whole-heartedly welcome, help them instead discover where their real “tribe” is, which may be just one or two other like-minded kids.\n\nSmile Our nonverbal communications are powerful. Teach your children that smiling, standing up straight, giving eye contact, and having an open stance when talking to others all contribute to others naturally perceiving them as friendly and approachable. Kids who think other kids are being “mean” or leaving them out often aren’t aware of how others perceive their own negative affect. Children need to learn that by smiling and presenting a positive demeanor, more people will be attracted to them as a potential friend.\n\nRead more:\n\n7 Simple Steps to Teach Kids to Introduce Themselves\n\nAsk questions Most children love to talk about themselves, and asking good questions is often the entry point for building friendships. Brainstorm with your child what types of questions they might ask. Do you play any sports? What do you like to do after school? What’s your favorite recess game? What’s in your lunch? How many brothers and sisters do you have? Who’s your teacher? Practice at the dinner table by playing the role of potential friend and have your child initiate some questions. Of course, going along with asking questions is listening to the answer and asking follow-up questions. Kids (and adults) who master question-asking, listening, and follow-up are well-liked because they give people the opportunity to share about themselves. Read more about teaching children communication skills.\n\nInvite/Join For a friendship to begin, someone has to take action. This can be one person inviting another to do something or it can be joining in with what a child or group is already doing. Explain this concept and brainstorm simple, low-risk invitations: Do you want to play basketball or something else (during recess)? Can I sit next to you? Do you want to play catch? Would you like to come over after school? Another way to connect is for the child to ask to join a game. It’s important for the child to recognize that it’s not always appropriate to ask to join, because it won’t be well-received if it disrupts the flow of play. Sometimes, in the middle of a game, it’s difficult to include a new player. So, rather than asking to join right then, the child can assess what others are doing and say, “Hey, can I play the next game?” rather than intruding at the midway point.\n\nShare Sharing is an important social skill, because if done well, it can enhance friendships. When lacking or done poorly, it can serve as a social repellant. Young kids need assistance learning to share objects – toys, books, markers, etc. As they get older, kids need to learn to share about themselves in a way that doesn’t sound boastful but helps others get to know them. On a vacation last year, my family and I found ourselves in a Jacuzzi with a boy who went on and on about how he was professional at Parkour. He talked about stunts he performed and how he was the “best” at certain maneuvers. My kids still talk about him, because his bragging was unforgettable. It’s a lesson for us all. Yes, share about yourself to help others get to know you, but also ask questions and listen to what others have to say. Sharing the spotlight is an important skill. Let others be in the high beam sometimes.\n\n\n\nBe happy for friends’ victories Responding positively to others’ triumphs is a friendship-enhancing skill that research has proven also enhances marriages and other relationships. If you can truly be as happy and excited for your friend’s victory as if it were your own, that’s an excellent relational skill. When talking with younger kids, you could use the example of how you feel when your friend beats you in a race or gets a better grade on a test. While the natural response might be jealousy, celebrating and congratulating your friend will be great for the friendship. When we truly celebrate others’ accomplishments, our connection gets stronger; hopefully, the friend reciprocates by being happy for us and our victories.\n\nDevelop coping strategies for difficult emotions (anger, sadness) In research on which kids are most well-liked by peers and which kids are disliked or rejected, difficulty handling emotions (self-regulation) appears to be the biggest repellant. Kids (and adults!) who lash out or overreact to negative situations just aren’t pleasant to be around and are often disliked by peers. Therefore, it is vitally important that kids who struggle with regulating and acting on their feelings learn to handle difficult emotions in a constructive way. Help your child find coping strategies that work.", "domain": "sunshine-parenting.com"}