{"url": "https://www.seattlechildrens.org/health-safety/nutrition-wellness/good-night-sleep-routine/", "title": "A Good Night's Sleep Can Be Routine for Kids – and Their Parents", "text": "Generations of parents have flopped down on a cozy bed after a long day, breathed a sigh of relief and thought, \"Why can't my child look forward to bedtime as much as I do?\"\n\nOf course, for many children (and you, their tired parents) the reality is that bedtime can be the most dreaded time of day. You've likely had to put up with your child's clever strategies to delay going to bed: tantrums, demands for more book reading, pleas for water or milk and other tricks.\n\nYet you know how important it is for your child to get the right amount of sleep for their healthy growth and brain development. Without enough sleep, kids can become hyper and irritable and have a hard time obeying. Getting enough quality sleep can help children in school and at home. So what can you do?\n\nEstablish a Bedtime Routine That You Follow Each Night\n\nKeep consistent bedtimes and wake times every day of the week. Late weekend nights or sleeping-in can throw off a sleep schedule for days. Avoid spending lots of non-sleep time in bed – spending hours lying on a bed doing other activities before bedtime keeps our brains from associating the bed with sleep time. Your child’s bedroom should be cool, quiet and comfortable. Children who stare at clocks should have their clocks turned away from them. Bedtime should follow a predictable sequence of events, such as brushing teeth and reading a story. Avoid high stimulation activities just before bed, such as watching television, playing video games or exercise. Do not do these things during a nighttime awakening either. It is best not to have video games, televisions or telephones in your child’s bedroom. Having physical exercise as part of the day often helps with sleep time many hours later. Relaxation techniques such as performing deep, slow abdominal breaths or imagining positive scenes like being on a beach can help your child relax. Avoid caffeine (sodas, chocolate, tea, coffee) in the afternoons/evenings. Even if caffeine doesn’t prevent falling asleep it can still lead to shallow sleep or frequent awakenings. If your child is awake in bed tossing and turning, it is better for them to get out of bed to do a low stimulation activity (e.g., reading), then return to bed later. This keeps the bed from becoming associated with sleeplessness. If still awake after 20 to 30 minutes, spend another 20 minutes out of bed before lying down again. Worry time should not be at bedtime. Children with this problem can try having a “worry time” scheduled earlier when they are encouraged to think about and discuss their worries with a parent. Children should be put to bed drowsy, but still awake. Letting them fall asleep in other places forms habits that are difficult to break. Security objects at bedtime are often helpful for children who need a transition to feel safe and secure when their parent is not present. Try to include a doll, toy or blanket when you cuddle or comfort your child, which may help them adopt the object. When checking on your child at night, checks should be “brief and boring.” The purpose is to reassure your child you are present and that they are OK. If your child is never drowsy at the planned bedtime, you can try a temporary delay of bedtime by 30-minute increments until your child appears sleepy, so that they experience falling asleep more quickly once they get into bed. The bedtime should then be gradually advanced earlier until the desired bedtime is reached. Keep a sleep diary to keep track of naps, sleep times and activities to find patterns and target problem areas when things are not working.\n\nSimple Strategies to Create Healthy, Long-Lasting Sleep Habits\n\nInfants\n\nIt's not too early to start a bedtime routine. First, make sure your child has their needs met and isn't hungry, wet or cold. Also, avoid giving milk or formula to children over 4 months old during the night. They typically do not need the calories, and nighttime feedings can lead to severe tooth decay.\n\nToddlers/pre-schoolers\n\nAt this age, try to involve your child in making choices about their bedtime routine, such as which pajamas to wear. Also, be aware that TV watching can have a negative effect on children's sleep. Research at Seattle Children's found that children under 3 who watched more TV were more likely to have irregular naptime and bedtime schedules. The American Academy of Pediatrics recommends that children age 2 and younger not watch any television.\n\nSchool-age children/pre-teens\n\nIn this age group, children may seek private time with parents - without siblings around - just before bedtime. Try to build in this quiet time while also ensuring they get the full hours of sleep they need. Rest assured that providing a pleasant and predictable bedtime routine is comforting to children and can help them - and you - get the right amount of sleep. For all children, consistency is key. Once you've found a routine that works for your family, keep it up! And stay positive. Praising your child in the morning for going to bed on time (and staying in bed) may help create healthy sleep habits that last a lifetime.\n\nHow much sleep does my child or teen need?\n\nInfants (0 to 3 months) need 14 to 17 hours, including naps.\n\nBabies (4 to 12 months) need 12 to 16 hours, including naps.\n\nToddlers (1 to 2 years) need 11 to 14 hours, including naps.\n\nPreschool-age kids (3 to 5 years) need 10 to 13 hours, including naps.\n\nSchool-age kids (6 to 13) need 9 to 12 hours.\n\nTeens (14 to 17) need 8 to 10 hours of sleep nightly.\n\nMore Information\n\nRead All About Sleep to learn more.", "domain": "www.seattlechildrens.org"}