{"url": "https://www.sleepfoundation.org/children-and-sleep/bedtime-routine", "title": "Bedtime Routines for Children", "text": "Want to read more about all our experts in the field?\n\nDr. Callender is a board-certified obstetrician-gynecologist who has been working in women’s health for over a decade.\n\nWant to read more about all our experts in the field?\n\nDanielle is originally from Vancouver, BC, where she has spent many hours staring at her ceiling trying to fall asleep. Danielle studied the science of sleep with a degree in psychology at the University of British Columbia.\n\nWhen you buy through our links, we may earn a commission. Products or services may be offered by an affiliated entity. Learn more.\n\nKey Takeaways Bedtime routines are vital for a child’s sleep quality and quantity.\n\nConsistency and encouragement can help children maintain an ideal sleep schedule.\n\nCalming activities and easy-to-follow routines can reduce bedtime struggles in kids.\n\nGetting quality sleep is essential in childhood, yet research shows that as many as 20 to 30% Trusted Source National Library of Medicine, Biotech Information The National Center for Biotechnology Information advances science and health by providing access to biomedical and genomic information. View Source of babies and toddlers have trouble sleeping. If you’re the parent or caregiver of a young insomniac, you’ll know firsthand how frustrating it is to see your little one struggle with bedtime.\n\nOne of the easiest ways to set your child up for good sleep is by creating a bedtime routine. The good news is that it only takes a few nights Trusted Source National Library of Medicine, Biotech Information The National Center for Biotechnology Information advances science and health by providing access to biomedical and genomic information. View Source of following a bedtime routine to see improvements in your child’s sleep. Help Your Child Sleep Better With Pediatric Sleep Coaching our partner at sleepdoctor.com Learn More “Life-changing! My anxiety about my son’s sleeping habits were immediately reduced after talking to Sara. She went above and beyond to tailor a schedule to our goals, answer our questions, keep us on track, and check in to encourage us when we just thought we couldn’t do it anymore.” Rachael B. – Verified Customer Available for All Ages Specialized coaching for babies, toddlers, preschoolers/kindergarteners, and school-age children. Personalized Plan Personalized sleep training plan based on the specific situation and needs of your family. Unlimited Support Access to pediatric sleep consultants who will answer any questions you have as quickly as possible.\n\nWhat Is a Bedtime Routine, and What Are the Benefits?\n\nBedtime routines are a consistent, repetitive set of activities that are carried out before bed every night. They help prepare your child for sleep by having them relax and wind down. A predictable routine also gives your child a sense of security and teaches them how to fall asleep on their own.\n\nResearch shows that children who follow bedtime routines are more likely to go to sleep earlier, take less time falling asleep, sleep longer, and wake up less during the night. These benefits to sleep quality are still seen years later Trusted Source National Library of Medicine, Biotech Information The National Center for Biotechnology Information advances science and health by providing access to biomedical and genomic information. View Source in children who followed bedtime routines when they were younger.\n\nIn addition to improving sleep, bedtime routines teach your child self-care and lay the ground for working memory, attention, and other cognitive skills Trusted Source National Library of Medicine, Biotech Information The National Center for Biotechnology Information advances science and health by providing access to biomedical and genomic information. View Source . They also foster parent-child bonding and may help improve mood, stress levels, and behavior.\n\nIn the long term, these benefits translate to better readiness for school, as well as better academic performance and social skills. By contrast, those who don’t follow a bedtime routine in childhood are more likely to have sleep problems and be overweight during adolescence Trusted Source National Library of Medicine, Biotech Information The National Center for Biotechnology Information advances science and health by providing access to biomedical and genomic information. View Source .\n\nSetting a bedtime routine right from the beginning with your baby makes it easier to keep up healthy habits as your child grows.\n\nHow To Build a Bedtime Routine for Kids\n\nA bedtime routine for kids usually consists of three or four activities, for example, having a snack, brushing teeth, putting on pajamas, and reading a book. These should always be done in the same order. To make the routine even more effective, start winding down the household by dimming the lights and turning off screens in the lead-up to bed.\n\nTypical bedtime activities that have been shown to have beneficial effects Trusted Source Sleep Medicine Reviews View Source on sleep include:\n\nNutritious snack or bottle/breastfeeding\n\nBath or diaper change\n\nBrushing teeth and going to the bathroom\n\nReading a book\n\nLullaby or singing a song together\n\nMassage, cuddling, and rocking\n\nTalking about their day\n\nThe bedtime routine should culminate in a goodnight kiss and lights-out. You should leave the room while your child is sleepy but not asleep yet. This way they learn to fall asleep on their own, and they won’t panic if they wake up in the middle of the night and find you gone. Set a consistent bedtime that leaves enough time for your child to sleep the recommended amount of hours for their age.\n\nBedtime Dos and Don’ts\n\nCertain activities are counterproductive to sleep and may cause your child to form unhealthy habits. Of course, every child is different and you may find it takes some trial-and-error to find out what works best for your family. However, when crafting your child’s bedtime routine, try to stick to the following advice:\n\nDo:\n\nDo it every day : A nighttime routine for kids should consist of the same steps every night Trusted Source National Library of Medicine, Biotech Information The National Center for Biotechnology Information advances science and health by providing access to biomedical and genomic information. View Source as many nights as possible Trusted Source National Library of Medicine, Biotech Information The National Center for Biotechnology Information advances science and health by providing access to biomedical and genomic information. View Source both parents Trusted Source National Library of Medicine, Biotech Information The National Center for Biotechnology Information advances science and health by providing access to biomedical and genomic information. View Source\n\n: A nighttime routine for kids should consist of the Keep it short and sweet : For most children, a bedtime routine should last around half an hour, or a little longer if there’s a bath included. Prolonging the routine can delay bedtime and makes it harder to implement on days when you’re short on time.\n\n: For most children, a bedtime routine should last around half an hour, or a little longer if there’s a bath included. Prolonging the routine can delay bedtime and makes it harder to implement on days when you’re short on time. Keep it up during the day : Following a routine during the day, including setting clear limits, leads to increased sleep duration Trusted Source National Library of Medicine, Biotech Information The National Center for Biotechnology Information advances science and health by providing access to biomedical and genomic information. View Source\n\n: Following a routine during the day, including setting clear limits, leads to Listen to your child : Although you’re ultimately in charge, it’s not a bad thing to leave your child some liberty. If a part of the bedtime routine isn’t working for your child, listen to their concerns and adapt the routine if necessary.\n\n: Although you’re ultimately ", "domain": "www.sleepfoundation.org"}