{"url": "https://www.healthychildren.org/English/ages-stages/toddler/nutrition/Pages/Picky-Eaters.aspx", "title": "10 Tips for Parents of Picky Eaters", "text": "Page Content\n\nPicky eating is often the norm for toddlers. After the rapid growth of infancy, when babies usually triple in weight, a toddler’s growth rate – and appetite – tends to slow down.\n\nToddlers also are beginning to develop food preferences, a fickle process. A toddler’s favorite food one day may hit the floor the next, or a snubbed food might suddenly become the one he or she can’t get enough of. For weeks, they may eat 1 or 2 preferred foods – and nothing else.\n\nTry not to get frustrated by this typical toddler behavior. Just make healthy food choices available and know that, with time, your child's appetite and eating behaviors will level out. In the meantime, here are some tips that can help you get through the picky eater stage.\n\n1. Family style. Share a meal together as a family as often as you can. This means no media distractions like TV or cell phones at mealtime. Use this time to model healthy eating. Serve one meal for the whole family and resist the urge to make another meal if your child refuses what you've served. This only encourages picky eating. Try to include at least one food your child likes with each meal and continue to provide a balanced meal, whether she eats it or not.\n\n2. Food fights. If your toddler refuses a meal, avoid fussing over it. It’s good for children to learn to listen to their bodies and use hunger as a guide. If they ate a big breakfast or lunch, for example, they may not be interested in eating much the rest of the day. It's a parent's responsibility to provide food, and the child’s decision to eat it. Pressuring kids to eat, or punishing them if they don't, can make them actively dislike foods they may otherwise like.\n\n3. Break from bribes. Tempting as it may be, try not to bribe your children with treats for eating other foods. This can make the \"prize\" food even more exciting, and the food you want them to try an unpleasant chore. It also can lead to nightly battles at the dinner table.\n\n4. Try, try again. Just because a child refuses a food once, don't give up. Keep offering new foods and those your child didn't like before. It can take as many as 10 or more times tasting a food before a toddler’s taste buds accept it. Scheduled meals and limiting snacks can help ensure your child is hungry when a new food is introduced.\n\n5. Variety: the spice. Offer a variety of healthy foods, especially vegetables and fruits, and include higher protein foods like meat and deboned fish at least 2 times per week. Help your child explore new flavors and textures in food. Try adding different herbs and spices to simple meals to make them tastier. To minimize waste, offer new foods in small amounts and wait at least a week or two before reintroducing the same food.\n\n6. Make food fun. Toddlers are especially open to trying foods arranged in eye-catching, creative ways. Make foods look irresistible by arranging them in fun, colorful shapes kids can recognize. Kids this age also tend to enjoy any food involving a dip. Finger foods are also usually a hit with toddlers. Cut solid foods into bite size pieces they can easily eat themselves, making sure the pieces are small enough to avoid the risk of choking.\n\n7. Involve kids in meal planning. Put your toddler's growing interest in exercising control to good use. Let you child pick which fruit and vegetable to make for dinner or during visits to the grocery store or farmer's market. Read kid-friendly cookbooks together and let your child pick out new recipes to try.\n\n8. Tiny chefs. Some cooking tasks are perfect for toddlers (with lots of supervision, of course): sifting, stirring, counting ingredients, picking fresh herbs from a garden or windowsill, and “painting” on cooking oil with a pastry brush, to name a few.\n\n9. Crossing bridges. Once a food is accepted, use what nutritionists call \"food bridges\" to introduce others with similar color, flavor and texture to help expand variety in what your child will eat. If your child likes pumpkin pie, for example, try mashed sweet potatoes and then mashed carrots.\n\n10. A fine pair. Try serving unfamiliar foods, or flavors young children tend to dislike at first (sour and bitter), with familiar foods toddlers naturally prefer (sweet and salty). Pairing broccoli (bitter) with grated cheese (salty), for example, is a great combination for toddler taste buds.\n\nRemember…\n\nIf you are concerned about your child’s diet, talk with your pediatrician, who can help troubleshoot and make sure your child is getting all the necessary nutrients to grow and develop. Also keep in mind that picky eating usually is a normal developmental stage for toddlers. Do your best to patiently guide them on their path toward healthy eating.\n\nAdditional Information:", "domain": "www.healthychildren.org"}